Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: generating (303), by the relay device, second channel allocation information based on the first channel allocation information, wherein the second channel allocation information comprises indication information used to indicate a second time period on the subchannel, and the second time period is operation time of the relay device on the subchannel, in which the relay device communicates with the AP and child nodes associated with the relay device; wherein
de_de: Generieren (303) zweiter Kanalzuteilungsinformationen durch die Relaisvorrichtung auf der Grundlage der ersten Kanalzuteilungsinformationen, wobei die zweiten Kanalzuteilungsinformationen Anzeigeinformationen umfassen, die zum Anzeigen einer zweiten Zeitperiode auf dem Unterkanal verwendet werden, und die zweite Zeitperiode eine Betriebszeit der Relaisvorrichtung auf dem Unterkanal ist, in der die Relaisvorrichtung mit dem AP und den mit der Relaisvorrichtung assoziierten untergeordneten Knoten kommuniziert; wobei

source: the second time period includes the first time period; and
de_de: der zweite Zeitraum den ersten Zeitraum beinhaltet; und

source: sending (304), by the relay device, the second channel allocation information to a child node of the relay device.
de_de: Senden (304) der zweiten Kanalzuteilungsinformationen durch die Relaisvorrichtung an einen untergeordneten Knoten der Relaisvorrichtung.

source: 2. The method according to claim 1, wherein the subchannel is one of a plurality of subchannels, and the second channel allocation information further comprises indication information used to indicate a time period on another subchannel different from the subchannel in the plurality of subchannels, wherein the time period on the another subchannel is operation time of the relay device on the another subchannel and is different from the second time period.
de_de: 2. Verfahren nach Anspruch 1, wobei der Unterkanal einer von einer Vielzahl von Unterkanälen ist und die zweiten Kanalzuteilungsinformationen ferner Anzeigeinformationen umfassen, die verwendet werden, um einen Zeitraum auf einem anderen Unterkanal anzuzeigen, der sich von dem Unterkanal in der Vielzahl von Unterkanälen unterscheidet, wobei der Zeitraum auf dem anderen Unterkanal eine Betriebszeit der Relaisvorrichtung auf dem anderen Unterkanal ist und sich von dem zweiten Zeitraum unterscheidet.

source: 3. The method according to claim 1 or 2, wherein the second channel allocation information comprises:
de_de: 3. Verfahren nach Anspruch 1 oder 2, wobei die zweiten Kanalzuteilungsinformationen Folgendes umfassen:

source: a time offset, used to indicate a start moment of the 1st time period in operation time of the relay device;
de_de: einen Zeitversatz, der verwendet wird, um einen Startzeitpunkt des ersten Zeitraums in einer Betriebszeit der Relaisvorrichtung anzuzeigen;

source: a time period quantity identifier, used to indicate a quantity of time periods in the operation time of the relay device; and
de_de: einen Zeitraum-Mengenbezeichner, der verwendet wird, um eine Menge von Zeiträumen in der Betriebszeit der Relaisvorrichtung anzuzeigen; und

source: a subchannel identifier, used to indicate a subchannel corresponding to each time period in the operation time of the relay device.
de_de: einen Unterkanalbezeichner, der verwendet wird, um einen Unterkanal anzuzeigen, der mit jedem Zeitraum in der Betriebszeit der Relaisvorrichtung korrespondiert.

source: 4. The method according to any one of claims 1 to 3, wherein when duration of each time period in the operation time of the relay device is equal, the second channel allocation information further comprises the duration of the time period in the operation time of the relay device.
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei, wenn die Dauer jedes Zeitraums in der Betriebszeit der Relaisvorrichtung gleich ist, die zweiten Kanalzuteilungsinformationen ferner die Dauer des Zeitraums in der Betriebszeit der Relaisvorrichtung umfassen.

source: 5. The method according to any one of claims 1 to 3, wherein when durations of at least two time periods in the operation time of the relay device are unequal, the second channel allocation information further comprises an end moment of each time period in the operation time of the relay device.
de_de: 5. Verfahren nach einem der Ansprüche 1 bis 3, wobei, wenn die Dauer von mindestens zwei Zeiträumen in der Betriebszeit der Relaisvorrichtung ungleich ist, die zweiten Kanalzuteilungsinformationen ferner einen Endzeitpunkt jedes Zeitraums in der Betriebszeit der Relaisvorrichtung umfassen.

source: 6. The method according to any one of claims 1 to 5, wherein the subchannel is one of the plurality of subchannels, and the first channel allocation information further comprises indication information used to indicate operation time of the AP on another subchannel different from the subchannel in the plurality of subchannels, wherein the operation time of the AP on the another subchannel different from the subchannel in the plurality of subchannels is different from the first time period.
de_de: 6. Verfahren nach einem der Ansprüche 1 bis 5, wobei der Unterkanal einer der Vielzahl von Unterkanälen ist und die ersten Kanalzuteilungsinformationen ferner Anzeigeinformationen umfassen, die verwendet werden, um eine Betriebszeit des AP auf einem anderen Unterkanal anzuzeigen, der sich von dem Unterkanal in der Vielzahl von Unterkanälen unterscheidet, wobei die Betriebszeit des AP auf dem anderen Unterkanal, der sich von dem Unterkanal in der Vielzahl von Unterkanälen unterscheidet, sich von dem ersten Zeitraum unterscheidet.

source: 7. The method according to any one of claims 1 or 6, wherein the first channel allocation information comprises:
de_de: 7. Verfahren nach einem der Ansprüche 1 oder 6, wobei die ersten Kanalzuteilungsinformationen Folgendes umfassen:

source: a time offset, used to indicate a start moment of the 1st time period in operation time of the AP;
de_de: einen Zeitversatz, der verwendet wird, um einen Startzeitpunkt des ersten Zeitraums in einer Betriebszeit des AP anzuzeigen;

source: a time period quantity identifier, used to indicate a quantity of time periods in the operation time of the AP; and
de_de: einen Zeitraum-Mengenbezeichner, der verwendet wird, um eine Menge von Zeiträumen in der Betriebszeit des AP anzuzeigen; und

source: a subchannel identifier, used to indicate a subchannel corresponding to each time period in the operation time of the AP; wherein
de_de: einen Unterkanalbezeichner, der verwendet wird, um einen Unterkanal anzuzeigen, der mit jedem Zeitraum in der Betriebszeit des AP korrespondiert; wobei

source: the operation time of the AP comprises at least the first time period.
de_de: die Betriebszeit des AP mindestens den ersten Zeitraum umfasst.

source: 8. The method according to claim 7, wherein
de_de: 8. Verfahren nach Anspruch 7, wobei,

source: when duration of each time period in the operation time of the AP is equal, the first channel allocation information further comprises the duration of the time period in the operation time of the AP.
de_de: wenn die Dauer jedes Zeitraums in der Betriebszeit des AP gleich ist, die ersten Kanalzuteilungsinformationen ferner die Dauer des Zeitraums in der Betriebszeit des AP umfassen.

source: 9. The method according to claim 7, wherein
de_de: 9. Verfahren nach Anspruch 7, wobei,

source: when durations of at least two time periods in the operation time of the AP are unequal, the first channel allocation information further comprises an end moment of each time period in the operation time of the AP.
de_de: wenn die Dauer von mindestens zwei Zeiträumen in der Betriebszeit des AP ungleich ist, die ersten Kanalzuteilungsinformationen ferner einen Endzeitpunkt jedes Zeitraums in der Betriebszeit des AP umfassen.

source: The method according to any one of claims 1 to 9, wherein the method further comprises: receiving, by the relay device, occupation information used to indicate a time period on a scheduled subchannel in a system, wherein the scheduled subchannel at least comprises at least the subchannel, the system comprises the AP and a plurality of relay devices, and the relay device is one of the plurality of relay devices.
de_de: Verfahren nach einem der Ansprüche 1 bis 9, wobei das Verfahren ferner Folgendes umfasst: Empfangen von Belegungsinformationen durch die Relaisvorrichtung, die verwendet werden, um einen Zeitraum auf einem geplanten Unterkanal in einem System anzuzeigen, wobei der geplante Unterkanal mindestens den Unterkanal umfasst, das System den AP und eine Vielzahl von Relaisvorrichtungen umfasst und die Relaisvorrichtung eine der Vielzahl von Relaisvorrichtungen ist.

source: The method according to claim 10, wherein the occupation information comprises:
de_de: Verfahren nach Anspruch 10, wobei die Belegungsinformationen Folgendes umfassen:

source: a time offset, used to indicate a start moment of the 1st time period in time periods occupied on the scheduled subchannel in the system;
de_de: einen Zeitversatz, der verwendet wird, um einen Startzeitpunkt des ersten Zeitraums in Zeiträumen anzuzeigen, die auf dem geplanten Unterkanal in dem System belegt sind;

source: a time period quantity identifier, used to indicate a quantity of time periods occupied on the scheduled subchannel in the system;
de_de: einen Zeitraum-Mengenbezeichner, der verwendet wird, um eine Menge von Zeiträumen anzuzeigen, die auf dem geplanten Unterkanal in dem System belegt sind;

source: a subchannel identifier, used to indicate each of the scheduled subchannel; and
de_de: einen Unterkanalbezeichner, der verwendet wird, um jeden der geplanten Unterkanäle anzuzeigen; und

source: a subchannel time period occupation identifier, used to indicate whether each time period on each of the scheduled subchannel in the system is occupied, or used to indicate a quantity of basic service sets that occupy each time period on each of the scheduled subchannel in the system; wherein
de_de: einen Unterkanal-Zeitraum-Belegungsbezeichner, der verwendet wird, um anzuzeigen, ob jeder Zeitraum auf jedem der geplanten Unterkanäle in dem System belegt ist, oder um eine Menge von Basisdienstsätzen anzuzeigen, die jeden Zeitraum auf jedem der geplanten Unterkanäle in dem System belegen; wobei

source: the time period occupied on the scheduled subchannel in the system comprises at least the first time period.
de_de: der auf dem geplanten Unterkanal in dem System belegte Zeitraum mindestens den ersten Zeitraum umfasst.

source: A relay device (1700), wherein the relay device (1700) is one of one or more child nodes of an access point, AP, and the relay device (1700) comprises:
de_de: Relaisvorrichtung (1700), wobei die Relaisvorrichtung (1700) einer von einem oder mehreren untergeordneten Knoten eines Zugangspunkts (AP) ist und die Relaisvorrichtung (1700) Folgendes umfasst:

source: a transceiver (1720), configured to receive first channel allocation information sent by the AP, wherein the first channel allocation information comprises indication information used to indicate a first time period on a subchannel, and the first time period is operation time of the AP on the subchannel, in which the AP communicates with the relay device; and
de_de: einen Sender-Empfänger (1720), konfiguriert, um von dem AP gesendete erste Kanalzuteilungsinformationen zu empfangen, wobei die ersten Kanalzuteilungsinformationen Anzeigeinformationen umfassen, die verwendet werden, um einen ersten Zeitraum auf einem Unterkanal anzuzeigen, und der erste Zeitraum eine Betriebszeit des AP auf dem Unterkanal ist, in der der AP mit der Relaisvorrichtung kommuniziert; und

source: a processor (1710), configured to generate second channel allocation information based on the first channel allocation information, wherein the second channel allocation information comprises indication information used to indicate a second time period on the subchannel, and the second time period is operation time of the relay device on the subchannel, in which the relay device communicates with the AP and child nodes associated with the relay device; wherein
de_de: einen Prozessor (1710), konfiguriert, um auf der Grundlage der ersten Kanalzuteilungsinformationen zweite Kanalzuteilungsinformationen zu generieren, wobei die zweiten Kanalzuteilungsinformationen Anzeigeinformationen umfassen, die verwendet werden, um einen zweiten Zeitraum auf dem Unterkanal anzuzeigen, und der zweite Zeitraum eine Betriebszeit der Relaisvorrichtung auf dem Unterkanal ist, in der die Relaisvorrichtung mit dem AP und den mit der Relaisvorrichtung assoziierten untergeordneten Knoten kommuniziert; wobei

source: the transceiver (1720) is configured to send the second channel allocation information to a child node of the relay device (1700).
de_de: der Sender-Empfänger (1720) konfiguriert ist, um die zweiten Kanalzuteilungsinformationen an einen untergeordneten Knoten der Relaisvorrichtung (1700) zu senden.

source: A computer-readable storage medium, comprising an instruction, wherein when the instruction is run on a computer, the computer performs the method according to any one of claims 1 to 11.
de_de: Computerlesbares Speichermedium, umfassend einen Befehl, wobei der Computer, wenn der Befehl auf einem Computer ausgeführt wird, das Verfahren nach einem der Ansprüche 1 bis 11 ausführt.

source: 1. A data forwarding method, comprising:
de_de: 1. Datenweiterleitungsverfahren, umfassend:

source: after congestion of an egress queue of a network device is relieved, receiving (S401), by the network device, a packet sent by an upstream node;
de_de: nachdem eine Überlastung einer Ausgangswarteschlange einer Netzwerkvorrichtung entlastet wurde, Empfangen (S401) eines durch einen Upstream-Knoten gesendeten Pakets durch die Netzwerkvorrichtung;

source: obtaining (S402), by the network device, a flowkey of the packet, wherein the flowkey indicates a data flow to which the packet belongs;
de_de: Erlangen (S402) eines Flussschlüssels des Pakets durch die Netzwerkvorrichtung, wobei der Flussschlüssel einen Datenfluss angibt, zu dem das Paket gehört;

source: determining (S403), by the network device based on the flowkey, whether a previous packet belonging to the data flow is buffered in a storage device associated with the egress queue; and
de_de: Bestimmen (S403) durch die Netzwerkvorrichtung basierend auf dem Flussschlüssel, ob ein vorheriges zu dem Datenfluss gehörendes Paket in einer mit der Ausgangswarteschlange assoziierten Speichervorrichtung gepuffert ist; und,

source: when the storage device does not buffer the previous packet of the data flow, scheduling (S4041), by the network device, the packet to the egress queue, to forward the packet to a downstream node;
de_de: wenn die Speichervorrichtung das vorherige Paket des Datenflusses nicht puffert, Einplanen (S4041) des Pakets in der Ausgangswarteschlange durch die Netzwerkvorrichtung, um das Paket an einen Downstream-Knoten weiterzuleiten;

source: when the previous packet of the data flow is buffered in the storage device, sending (S4042), by the network device, the packet to the storage device for buffering;
de_de: wenn das vorherige Paket des Datenflusses in der Speichervorrichtung gepuffert ist, Senden (S4042) des Pakets zum Puffern durch die Netzwerkgvorrichtung an die Speichervorrichtung;

source: wherein the storage device is configured to buffer a packet that is received by the network device during congestion of the egress queue; wherein the storage device includes a plurality of buffer queues, and each buffer queue is associated with one egress queue of the network device.
de_de: wobei die Speichervorrichtung konfiguriert ist, um ein Paket zu puffern, das während Überlastung der Ausgangswarteschlange durch die Netzwerkvorrichtung empfangen wird; wobei die Speichervorrichtung eine Vielzahl von Pufferwarteschlangen aufweist und jede Pufferwarteschlange mit einer Ausgangswarteschlange der Netzwerkvorrichtung assoziiert ist.

source: 2. The method according to claim 1, further comprising:
de_de: 2. Verfahren nach Anspruch 1, ferner umfassend:

source: sending, by the network device, the received packet to the storage device for buffering during congestion of the egress queue.
de_de: Senden des empfangenen Pakets durch die Netzwerkvorrichtung an die Speichervorrichtung zum Puffern während Überlastung der Ausgangswarteschlange.

source: 3. The method according to any one of claims 1 to 2, further comprising:
de_de: 3. Verfahren nach einem der Ansprüche 1 bis 2, ferner umfassend:

source: recording, by the network device, a quantity of packets of each data flow that are buffered in the storage device.
de_de: Aufzeichnen durch die Netzwerkvorrichtung einer Menge von Paketen jedes Datenflusses, die in der Speichervorrichtung gepuffert sind.

source: 4. The method according to claim 3, wherein
de_de: 4. Verfahren nach Anspruch 3, wobei

source: the network device records, in a flow table, the quantity of packets of each data flow that are buffered in the storage device, wherein the flow table comprises at least one entry, and each entry comprises one flowkey and a packet quantity corresponding to the flowkey.
de_de: die Netzwerkvorrichtung in einer Flusstabelle die Menge von Paketen jedes Datenflusses aufzeichnet, die in der Speichervorrichtung gepuffert wird, wobei die Flusstabelle mindestens einen Eintrag umfasst und jeder Eintrag einen Flussschlüssel und eine mit dem Flussschlüssel korrespondierende Paketmenge umfasst.

source: 5. The method according to claim 4, wherein the determining, by the network device based on the flowkey, whether a previous packet belonging to the data flow is buffered in a storage device associated with the egress queue comprises:
de_de: 5. Verfahren nach Anspruch 4, wobei das Bestimmen durch die Netzwerkvorrichtung basierend auf dem Flussschlüssel, ob ein vorheriges zu dem Datenfluss gehörendes Paket in einer mit der Ausgangswarteschlange assoziierten Speichervorrichtung gepuffert ist, umfasst:

source: querying, by the network device, the flow table based on the flowkey, to obtain a packet quantity corresponding to the data flow in the flow table; and
de_de: Abfragen der Flusstabelle durch die Netzwerkvorrichtung basierend auf dem Flussschlüssel, um eine Paketmenge zu erlangen, die mit dem Datenfluss in der Flusstabelle korrespondiert; und,

source: when the packet quantity is equal to 0, determining, by the network device, that the storage device currently does not buffer the previous packet of the data flow; or
de_de: wenn die Paketmenge gleich 0 ist, Bestimmen durch die Netzwerkvorrichtung, dass die Speichervorrichtung das vorherige Paket des Datenflusses derzeit nicht puffert; oder,

source: when the packet quantity is greater than 0, determining, by the network device, that the storage device currently buffers the previous packet of the data flow.
de_de: wenn die Paketmenge größer als 0 ist, Bestimmen durch die Netzwerkvorrichtung, dass die Speichervorrichtung das vorherige Paket des Datenflusses derzeit puffert.

source: 6. A network device, comprising a memory and a processor, wherein the memory is coupled to the processor, the memory is configured to store computer program code, the computer program code comprises computer instructions, and when the processor executes the computer instructions, the network device is enabled to perform the method according to any one of claims 1 to 5.
de_de: 6. Netzwerkvorrichtung, umfassend einen Speicher und einen Prozessor, wobei der Speicher mit dem Prozessor gekoppelt ist, der Speicher konfiguriert ist, um einen Computerprogrammcode zu speichern, der Computerprogrammcode eine Computeranweisung umfasst und die Netzwerkvorrichtung in die Lage versetzt wird, das Verfahren nach einem der Ansprüche 1 bis 5 durchzuführen, wenn der Prozessor die Computeranweisung ausführt.

source: 7. A computer storage medium, comprising computer instructions, wherein when the computer instructions are run on a network device, the network device is enabled to perform the method according to any one of claims 1 to 5.
de_de: 7. Computer-Speichermedium, umfassend Computeranweisungen, wobei, wenn die Computeranweisungen auf einer Netzwerkvorrichtung ablaufen, die Netzwerkvorrichtung in die Lage versetzt wird, das Verfahren nach einem der Ansprüche 1 bis 5 durchzuführen.

source: 1. A communication method, wherein the method is performed by a terminal device or a component of the terminal device, and the terminal device is in a radio resource control inactive mode, comprising:
de_de: 1. Kommunikationsverfahren, wobei das Verfahren von einem Endgerät oder einer Komponente des Endgeräts durchgeführt wird und das Endgerät in einem inaktiven Modus der Funkressourcensteuerung ist, umfassend:

source: obtaining a cell identifier;
de_de: Erlangen einer Zellenkennung;

source: obtaining first configuration information based on the cell identifier, wherein there is a correspondence between the cell identifier and the first configuration information, and the cell identifier is an identifier of a cell in a radio access network-based notification area, RNA; and
de_de: Erlangen erster Konfigurationsinformationen basierend auf der Zellenkennung, wobei eine Entsprechung zwischen der Zellenkennung und den ersten Konfigurationsinformationen besteht und die Zellenkennung eine Kennung einer Zelle in einem funkzugangsnetzbasierten Benachrichtigungsbereich (radio access network-based notification area – RNA) ist; und

source: performing one or more of the following operations based on the first configuration information:
de_de: Durchführen einer oder mehrerer der folgenden Operationen basierend auf den ersten Konfigurationsinformationen:

source: receiving downlink control information, DCI, receiving downlink data, sending uplink control information, or sending uplink data; and
de_de: Empfangen von Downlink-Steuerinformationen (downlink control information – DCI), Empfangen von Downlink-Daten, Senden von Uplink-Steuerinformationen oder Senden von Uplink-Daten; und

source: wherein the first configuration information is used to configure a radio network temporary identifier; and
de_de: wobei die ersten Konfigurationsinformationen verwendet werden, um eine temporäre Funknetzwerkkennung zu konfigurieren; und

source: the correspondence between the cell identifier and the first configuration information includes a correspondence between the cell identifier and the radio network temporary identifier; and
de_de: die Entsprechung zwischen der Zellenkennung und den ersten Konfigurationsinformationen eine Entsprechung zwischen der Zellenkennung und der temporären Funknetzwerkkennung beinhaltet; und

source: obtaining the first configuration information based on the cell identifier comprises obtaining the radio network temporary identifier based on the cell identifier.
de_de: Erlangen der ersten Konfigurationsinformationen basierend auf der Zellenkennung Erlangen der temporären Funknetzwerkkennung basierend auf der Zellenkennung umfasst.

source: 2. The method according to claim 1, wherein the method further comprises:
de_de: 2. Verfahren nach Anspruch 1, wobei das Verfahren ferner Folgendes umfasst:

source: receiving second configuration information, wherein the second configuration information is used to configure the correspondence between the cell identifier and the first configuration information.
de_de: Empfangen zweiter Konfigurationsinformationen, wobei die zweiten Konfigurationsinformationen verwendet werden, um die Entsprechung zwischen der Zellenkennung und den ersten Konfigurationsinformationen zu konfigurieren.
